package com.pyo.parcelservice.view;

public class MenuViewer {
	// 메인메뉴
	public static void mainMenuView() {
		System.out.println("────────────────────────────────────────────────────────────────────────────");
		System.out.println("                              ─ 배송 관리 시스템 ─                              ");
		System.out.println("────────────────────────────────────────────────────────────────────────────");
		System.out.println("1. 회원정보 메뉴 │ 2. 상품 정보 메뉴 │ 3. 업체 정보 메뉴 │ 4. 주문 정보 메뉴 │ 5. 종료   ");
		System.out.println("────────────────────────────────────────────────────────────────────────────");
		System.out.print("실행할 메뉴의 번호를 입력하세요.\n>> ");

	}

	// 회원정보 메뉴
	public static void customerMenuView() {
		System.out.println("──────────────────────────────────────────────────────────────────────────────────────────────────");
		System.out.println("                                     ─ 회원 정보 메뉴 ─                                   ");
		System.out.println("──────────────────────────────────────────────────────────────────────────────────────────────────");
		System.out.println("1. 회원 정보 목록 │ 2. 회원 정보 입력 │ 3. 회원 정보 수정 │ 4. 회원 정보 삭제 │ 5. 회원 정보 정렬 │ 6. 메인 메뉴   ");
		System.out.println("──────────────────────────────────────────────────────────────────────────────────────────────────");
		System.out.print("실행할 메뉴의 번호를 입력하세요.\n>> ");

	}

	// 상품정보 메뉴
	public static void productMenuView() {
		System.out.println("─────────────────────────────────────────────────────────────────────────────────────");
		System.out.println("                              ─ 상품 정보 메뉴 ─                                   ");
		System.out.println("─────────────────────────────────────────────────────────────────────────────────────");
		System.out.println("1. 상품 정보 목록 │ 2. 상품 정보 입력 │ 3. 상품 정보 수정 │ 4. 상품 정보 삭제 │ 5. 메인 메뉴   ");
		System.out.println("─────────────────────────────────────────────────────────────────────────────────────");
		System.out.print("실행할 메뉴의 번호를 입력하세요.\n>> ");

	}

	//배송업체 정보 메뉴
	public static void deliveryMenuView() {
		System.out.println("─────────────────────────────────────────────────────────────────────────────────────");
		System.out.println("                              ─ 배송업체 정보 메뉴 ─                                   ");
		System.out.println("─────────────────────────────────────────────────────────────────────────────────────");
		System.out.println("1. 배송 업체 목록 │ 2. 업체 정보 입력 │ 3. 업체 정보 수정 │ 4. 업체 정보 삭제 │ 5. 메인 메뉴   ");
		System.out.println("─────────────────────────────────────────────────────────────────────────────────────");
		System.out.print("실행할 메뉴의 번호를 입력하세요.\n>> ");
		
	}
	
	// 주문정보 메뉴
	public static void ordersMenuView() {
		System.out.println(
				"─────────────────────────────────────────────────────────────────────────────────────────────────────");
		System.out
				.println("                                           ─ 주문 정보 메뉴 ─                                   ");
		System.out.println(
				"─────────────────────────────────────────────────────────────────────────────────────────────────────");
		System.out.println("1. 주문 정보 목록 │ 2. 주문 정보 입력 │ 3. 주문 정보 수정 │ 4. 주문 정보 삭제 │ 5. 메인 메뉴   ");
		System.out.println(
				"─────────────────────────────────────────────────────────────────────────────────────────────────────");
		System.out.print("실행할 메뉴의 번호를 입력하세요.\n>> ");

	}


}
